; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v3)
             (pred_8 ?v11 ?v7)
             (pred_3 ?v6 ?v7)
             (pred_1 ?v5 ?v6 )
	     (pred_4 ?v6)
             (pred_11 ?v10)
             (pred_6 ?v11)
             (pred_5 ?v7)
             (pred_2 ?v6)
             (pred_9 ?v11)
             (pred_10 ?v6)
             (pred_7 ))



(:action op_5
:parameters (?v1 ?v13 ?v8 ?v4)
:precondition (and (pred_11 ?v1) (pred_11 ?v13) (pred_6 ?v8) (pred_5 ?v4)
          (pred_12 ?v1 ?v13) (pred_8 ?v8 ?v4)
                   (pred_3 ?v13 ?v4) (pred_4 ?v1) 
                   (pred_2 ?v13) (pred_9 ?v8))
:effect (and  (pred_10 ?v13) (not (pred_2 ?v13))))


(:action op_1
:parameters (?v1 ?v12)
:precondition (and (pred_11 ?v1) (pred_11 ?v12)
               (pred_4 ?v1) (pred_12 ?v1 ?v12) (pred_10 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v1))))

(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_11 ?v1) (pred_6 ?v8) 
                  (pred_4 ?v1) (pred_1 ?v8 ?v1) (pred_7 ))
:effect (and (pred_9 ?v8)
   (not (pred_1 ?v8 ?v1)) (not (pred_7 ))))


(:action op_2
:parameters (?v1 ?v9 ?v2)
:precondition (and (pred_11 ?v1) (pred_6 ?v9) (pred_6 ?v2)
                  (pred_4 ?v1) (pred_9 ?v2) (pred_1 ?v9 ?v1))
:effect (and (pred_9 ?v9) (pred_1 ?v2 ?v1)
        (not (pred_9 ?v2)) (not (pred_1 ?v9 ?v1))))

(:action op_4
:parameters (?v1 ?v8)
:precondition (and (pred_11 ?v1) (pred_6 ?v8) 
                  (pred_4 ?v1) (pred_9 ?v8))
:effect (and (pred_7 ) (pred_1 ?v8 ?v1) (not (pred_9 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_29 obj_06 obj_28 obj_15 obj_22 obj_01 obj_03 obj_09 obj_19 obj_23 obj_26 obj_12 obj_16 obj_05 obj_07 obj_18 obj_27 obj_11 obj_21 obj_10 obj_08 obj_30 obj_25 obj_14 obj_02
    obj_13 obj_04
    obj_17 obj_24 obj_20
    )

    (:init
       (pred_7)

       (pred_11 obj_29)
       (pred_11 obj_06)
       (pred_11 obj_28)
       (pred_11 obj_15)
       (pred_11 obj_22)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_23)
       (pred_11 obj_26)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_11)
       (pred_11 obj_21)
       (pred_11 obj_10)
       (pred_11 obj_08)
       (pred_11 obj_30)
       (pred_11 obj_25)
       (pred_11 obj_14)
       (pred_11 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_04)
       (pred_6 obj_17)
       (pred_6 obj_24)
       (pred_6 obj_20)

       (pred_12 obj_29 obj_01)
       (pred_12 obj_29 obj_06)
       (pred_12 obj_06 obj_03)
       (pred_12 obj_06 obj_28)
       (pred_12 obj_06 obj_29)
       (pred_12 obj_28 obj_09)
       (pred_12 obj_28 obj_15)
       (pred_12 obj_28 obj_06)
       (pred_12 obj_15 obj_19)
       (pred_12 obj_15 obj_22)
       (pred_12 obj_15 obj_28)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_22 obj_15)
       (pred_12 obj_01 obj_26)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_29)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_03 obj_06)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_09 obj_16)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_09 obj_28)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_19 obj_23)
       (pred_12 obj_19 obj_15)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_23 obj_07)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_19)
       (pred_12 obj_26 obj_18)
       (pred_12 obj_26 obj_12)
       (pred_12 obj_26 obj_01)
       (pred_12 obj_12 obj_27)
       (pred_12 obj_12 obj_16)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_12 obj_26)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_16 obj_09)
       (pred_12 obj_16 obj_12)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_07 obj_23)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_27)
       (pred_12 obj_18 obj_26)
       (pred_12 obj_27 obj_30)
       (pred_12 obj_27 obj_11)
       (pred_12 obj_27 obj_12)
       (pred_12 obj_27 obj_18)
       (pred_12 obj_11 obj_25)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_11 obj_27)
       (pred_12 obj_21 obj_14)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_21)
       (pred_12 obj_08 obj_30)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_30 obj_25)
       (pred_12 obj_30 obj_27)
       (pred_12 obj_30 obj_08)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_25 obj_11)
       (pred_12 obj_25 obj_30)
       (pred_12 obj_14 obj_02)
       (pred_12 obj_14 obj_21)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_14)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_18)
       (pred_3  obj_01 obj_13)
       (pred_3  obj_07 obj_04)
       (pred_3  obj_18 obj_13)
       (pred_10 obj_29)
       (pred_10 obj_06)
       (pred_10 obj_28)
       (pred_10 obj_15)
       (pred_10 obj_22)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_19)
       (pred_10 obj_23)
       (pred_10 obj_26)
       (pred_10 obj_12)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_27)
       (pred_10 obj_11)
       (pred_10 obj_21)
       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_30)
       (pred_10 obj_25)
       (pred_10 obj_14)
       (pred_10 obj_02)

       (pred_8  obj_17 obj_13)
       (pred_8  obj_24 obj_04)
       (pred_8  obj_20 obj_13)
       (pred_1 obj_17 obj_07)
       (pred_1 obj_24 obj_30)
       (pred_1 obj_20 obj_09)
       (pred_4 obj_28)
    )

    (:goal (and
       (pred_1 obj_20 obj_22)
    ))
(:constraints
  (always (not (pred_4 obj_15)))
)
)

; plan
1. (op_1 obj_28 obj_09)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_09)
   goals met: 0 of 1
2. (op_3 obj_09 obj_20)
   deleted: (pred_1 obj_20 obj_09) (pred_7)
   added: (pred_9 obj_20)
   goals met: 0 of 1
3. (op_1 obj_09 obj_19)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_19)
   goals met: 0 of 1
4. (op_1 obj_19 obj_23)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_23)
   goals met: 0 of 1
5. (op_1 obj_23 obj_22)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_22)
   goals met: 0 of 1
6. (op_4 obj_22 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_7) (pred_1 obj_20 obj_22)
   goals met: 1 of 1
